# Primary Brewfile for developer tools
# 
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "act"
brew "asdf"
brew "antibody"
brew "awscli"
brew "bat"
brew "direnv"
brew "gawk"
brew "gh"
brew "glow"
brew "gnupg"
brew "common-fate/granted/granted"
brew "graphviz"
brew "gtksourceview3"
brew "guile"
brew "jq"
brew "kcat"
brew "mkcert"
brew "openjdk"
brew "pnpm"
brew "pygobject3"
brew "python@3.11"
brew "snyk/tap/snyk"
brew "starship"
brew "stow"
brew "wget"
brew "yarn"
cask "orbstack"
cask "qlmarkdown"
cask "tabby"
cask "visual-studio-code"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-lato"
cask "font-noto-sans"
cask "font-victor-mono"
cask "font-work-sans"
