# Primary Brewfile for developer tools
# 
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "teamookla/speedtest"
tap "common-fate/granted"
brew "act"
brew "asdf"
brew "awscli"
brew "bat"
brew "direnv"
brew "gawk"
brew "gh"
brew "glow"
brew "gnupg"
brew "granted"
brew "graphviz"
brew "gtksourceview3"
brew "guile"
brew "jq"
brew "kcat"
brew "mkcert"
brew "openjdk"
brew "pnpm"
brew "pygobject3"
brew "python@3.11"
brew "speedtest"
brew "starship"
brew "stow"
brew "wget"
brew "yarn"
cask "alfred"
cask "bitwarden"
cask "discord"
cask "firefox"
cask "google-drive"
cask "github"
cask "obsidian"
cask "orbstack"
cask "plex"
cask "qlmarkdown"
cask "signal"
cask "spotify"
cask "tabby"
cask "tower"
cask "vlc"
cask "visual-studio-code"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-lato"
cask "font-noto-sans"
cask "font-victor-mono"
cask "font-work-sans"
